{
  "Projects": [
    {
      "show": true,
      "title": "ADP Kontraktor",
      "desc": [
        "ADP Kontraktor is a web-based construction project management platform developed to support end-to-end project operations, from initial client interaction to ongoing project execution. The system centralizes essential workflows such as project data management, house design selection, progress updates, and client communication, enabling more structured and transparent collaboration between all parties involved.",
        "From a technical perspective, the platform is built with a strong backend architecture using Laravel and PHP, ensuring maintainability, security, and scalability. It implements RESTful APIs, multi-role authentication and authorization (Admin, Supervisor, Customer Service, and Client), and a well-structured MySQL relational database with optimized queries, migrations, and seeders to maintain data consistency and performance.",
        "The system also emphasizes reliability and real-world usability by incorporating server-side validation, secure data handling, and error management. By combining robust backend logic with a functional web interface, ADP Kontraktor delivers a dependable solution for managing construction projects efficiently while remaining flexible for future feature expansion and system integration."
      ],
      "year": "2025",
      "preview": "Maintenance",
      "code": "",
      "thumbnail": "/image/projects/web/adp/homepage.png",
      "images": [
        "/image/projects/web/adp/adp1.png",
        "/image/projects/web/adp/adp2.png",
        "/image/projects/web/adp/adp3.png"
      ],
      "tech": [
        "PHP",
        "Livewire",
        "Laravel",
        "Tailwind CSS",
        "JavaScript",
        "MySQL",
        "Midtrans"
      ], 
      "slug": "adp-kontraktor",
      "category": [1]
    },
    {
      "show": true,
      "title": "SIMOSI",
      "desc": [
        "SIMOSI (Student Monitoring System) is a web-based information system designed to help schools and parents monitor students’ daily activities in a structured and transparent manner. The system focuses on providing accurate and up-to-date information regarding student attendance, guidance records, and behavioral reports, allowing parents to stay informed without needing to be physically present at school.",
        "The system is operated primarily by homeroom teachers, who are responsible for recording attendance data and documenting student guidance or violation reports. All records are stored in a centralized database and presented through a dedicated parent dashboard. To improve communication efficiency, SIMOSI integrates WhatsApp notifications, ensuring that important updates and reports are delivered directly to parents in a timely manner.",
        "By implementing SIMOSI, schools benefit from well-organized digital documentation, while parents gain better insight into their children’s academic and behavioral development. The system enhances collaboration between schools and families, supports continuous student supervision, and contributes to a more modern, efficient, and accountable student monitoring process."],
      "year": "2025",
      "preview": "Maintenance",
      "code": "",
      "thumbnail": "/image/projects/web/simosi/homepage.png",
      "images": [
        "/image/projects/web/simosi/homepage.png",
        "/image/projects/web/simosi/simosi2.png",
        "/image/projects/web/simosi/simosi3.png"

      ],
      "tech": [
        "PHP",
        "JavaScript",
        "Bootstrap",
        "MySQL"
      ], 
      "slug": "mind-mirror",
      "category": [1]
    },
    {
      "show": true,
      "title": "Tehku",
      "desc": [
        "The Tehku website is an information system designed to provide professional management of tea leaf sales operations. The system supports structured recording of sales transactions, cash inflow and outflow, and product stock movements, ensuring accurate and integrated operational management.",
        "To enhance data efficiency and reliability, the Tehku website implements database optimization techniques using stored procedures, cursors, views, and triggers. These mechanisms automate transaction processing, stock updates, and financial calculations directly at the database level, reducing redundancy, improving performance, and maintaining data consistency.",
        "In addition to sales management, the system includes employee attendance and payroll management features that are tightly integrated with operational data. This approach enables comprehensive management of financial records, inventory, and human resources within a single system, supporting effective and transparent business operations."],
      "year": "2025",
      "preview": "maintenance",
      "code": "https://github.com/yudhacm/tehku",
      "thumbnail": "/image/projects/web/tehku/homepage.png",
      "images": [
        "/image/projects/web/tehku/homepage.png",
        "/image/projects/web/tehku/tehku1.png",
        "/image/projects/web/tehku/tehku2.png",
        "/image/projects/web/tehku/tehku3.png"        
      ],
      "tech": [
        "HTML",
        "CSS",
        "Tailwind CSS",
        "MySQL",
        "JavaScript"
      ], 
      "slug": "tehku",
      "category": [1]
    },
    {
      "show": true,
      "title": "Pre - DiDi: Prediksi Dini Resiko Diabetes",
      "desc": [
        "This web-based Machine Learning application is designed to provide early diabetes prediction using a Decision Tree classification model. The system allows users to input numerical health-related data, which is then processed to generate a prediction indicating the potential risk of diabetes in an interpretable and user-friendly manner.",
        "The model is trained using structured numerical datasets and applies decision tree logic to classify outcomes based on defined feature thresholds. By leveraging this approach, the system offers transparent decision-making, making the prediction process easier to understand. The trained model is deployed using Streamlit, enabling real-time interaction through a web interface without requiring advanced technical knowledge from users.",
        "Through this application, users can receive immediate prediction results presented in clear language, supporting early awareness and preventive action. The integration of machine learning with a lightweight deployment framework demonstrates how data-driven solutions can be effectively delivered as accessible web applications for health-related decision support."],
      "year": "2025",
      "preview": "https://uaspendatayudhacaesarmaulana.streamlit.app/",
      "code": "https://yudhacm.github.io/pendata/UAS_Pendata.html",
      "thumbnail": "/image/projects/ai/predidi/homepage.png",
      "images": [
        "/image/projects/ai/predidi/homepage.png",
        "/image/projects/ai/predidi/predidi1.png"
      ],
      "tech": [
        "Decision Tree",
        "Python",
        "Sklearn",
        "Pandas",
        "Seaborn",
        "Matplotlib",
        "HTML",
        "Joblib",
        "Streamlit"
      ], 
      "slug": "predidi",
      "category": [2]
    },
    {
      "show": true,
      "title": "Voice Recognition",
      "desc": [
        "This web-based voice recognition application is designed to identify spoken command words “buka” and “tutup” from audio input recorded by different speakers. The system allows users to either record their voice directly through a microphone or upload an audio file, enabling flexible interaction while ensuring accurate command recognition across multiple speakers.",
        "The application processes audio signals through a structured feature extraction pipeline, including normalization, resampling, silence trimming, and MFCC (Mel-Frequency Cepstral Coefficients) extraction. These numerical audio features are then scaled and classified using a pre-trained machine learning model capable of distinguishing voice commands regardless of speaker differences. By focusing on acoustic characteristics rather than speaker identity, the system demonstrates robustness in recognizing the same commands spoken by different individuals.",
        "The trained model is deployed using Streamlit, providing a real-time and user-friendly web interface that displays the recognized command along with its confidence score. Prediction results are presented clearly, allowing users to immediately understand whether the spoken command corresponds to “buka” or “tutup”. This project highlights the practical implementation of speech-based command recognition using machine learning and demonstrates how audio classification models can be effectively delivered as interactive web applications."],
      "year": "2025",
      "preview": "https://voice-recognition-23-057-and-23-099.streamlit.app/",
      "code": "https://yudhacm.github.io/PSD/voice_recognition.html",
      "thumbnail": "/image/projects/ai/vr/homepagevr.png",
      "images": [
        "/image/projects/ai/vr/homepagevr.png"
      ],
      "tech": [
        "Support Vector Machine",
        "MFCC",
        "Python",
        "Librosa",
        "Pandas",
        "Soundfile",
        "Joblib",
        "Seaborn",
        "Matplotlib",
        "HTML",
        "Joblib",
        "Streamlit"
      ], 
      "slug": "voice-recognition",
      "category": [2]
    },
    {
      "show": true,
      "title": "Voice Detection",
      "desc": [
        "This voice prediction web application is designed to detect spoken command words “buka” and “tutup” from live microphone input. The system enables users to record their voice directly through a web interface, automatically converting the recorded audio into a valid waveform format for further processing and analysis.",
        "The application applies a robust audio processing pipeline that includes silence trimming, amplitude normalization, fixed-length signal adjustment, and feature extraction using MFCC (Mel-Frequency Cepstral Coefficients) along with their first- and second-order derivatives (delta and delta-delta). These features are aggregated using statistical pooling (mean and standard deviation) and standardized before being passed into a trained machine learning classification model. This approach allows the system to reliably recognize command words even when spoken by different individuals.",
        "Deployed using Streamlit, the system provides real-time prediction results along with confidence scores and class probability distributions. Users receive clear feedback indicating whether the spoken command is recognized as “buka” or “tutup”, while a confidence threshold ensures that uncertain predictions are properly flagged. This project demonstrates the practical implementation of audio-based machine learning for voice command prediction in an interactive and accessible web application."],
      "year": "2025",
      "preview": "https://prediksi-suara-230411100057.streamlit.app/",
      "code": "https://yudhacm.github.io/PSD/prediksi_suara.html",
      "thumbnail": "/image/projects/ai/vp/image.png",
      "images": [
        "/image/projects/ai/vp/image.png"
      ],
      "tech": [
        "Decision Tree",
        "Python",
        "Sklearn",
        "Pandas",
        "Seaborn",
        "Matplotlib",
        "HTML",
        "Joblib",
        "Streamlit"
      ], 
      "slug": "voice-detection",
      "category": [2]
    },
    {
      "show": true,
      "title": "Forecasting air quality",
      "desc": [
        "This forecasting web application predicts next-day NO₂ (nitrogen dioxide) concentration using a Random Forest regression model. Users manually input NO₂ values from the previous five days (t-1 to t-5), and the system produces a forecast for the next day, making it easy to perform quick predictions without requiring direct access to the full dataset or training pipeline.",
        "The system applies a structured machine learning workflow: input features are arranged to match the training feature schema and then normalized using a pre-trained MinMax scaler. The model generates predictions in the normalized space, which are then converted back to the original scale using an output scaler. This approach ensures consistent preprocessing between training and inference while maintaining stable model performance during deployment.",
        "Deployed with Streamlit, the application provides an interactive interface that displays the predicted NO₂ value along with an estimated conversion to µg/m³ and an air-quality category based on WHO guideline thresholds. A simple line chart visualizes historical inputs versus the forecasted value, helping users interpret the trend and the predicted outcome. Overall, this project demonstrates a practical implementation of time-lag feature forecasting for environmental monitoring through an accessible web application."],
      "year": "2025",
      "preview": "https://forecasting-no2-230411100057.streamlit.app/",
      "code": "https://yudhacm.github.io/PSD/Forecasting.html",
      "thumbnail": "/image/projects/ai/forecasting/homepage.png",
      "images": [
        "/image/projects/ai/forecasting/homepage.png",
        "/image/projects/ai/forecasting/image1.png"
      ],
      "tech": [
        "Random Forest Regressor",
        "Python",
        "OpenEO",
        "Sklearn",
        "Pandas",
        "Numpy",
        "Matplotlib",
        "HTML",
        "MinMaxScaler",
        "Streamlit"
      ], 
      "slug": "forecasting-air-quality",
      "category": [2]
    }
  ]
}
